# 导入设置
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
X=np.array([[32960750],
[34979980],
[36445584],
[22121820],
[23872759],
[25201860],
[24025093],
[30520926],
[19575990],
[23222751],
[13853640],
[18168201]]
)
bank_name=["上证指数","深证成指","创业板指","沪深300","中小板指"]
# X = df[['投资者悲观情绪指标月均值']]  #这里的自变量必须写成二维形式，一个因变量可能对应多个自变量
# Y = df[bank_name]
Y_all=np.array([[528387493.6,
720606581.5,
914325256.6,
936717339.2,
822734705.2,
779665889.7,
729605455.2,
831903689.3,
604489208.4,
569605998,
777072111.2,
689741146.1,
],
[332949146,
442343426.9,
545335504.6,
600227100.7,
454468180.3,
476900452.2,
425799962.5,
424060156.2,
301791941.6,
320075466.8,
390251168.7,
347336292.9
],
[91448592.26,
103463036.2,
132671618.7,
157658819.8,
111993115.6,
118704254.7,
102990806.3,
119286289.4,
82214259.09,
89736500.92,
99461465.75,
96039720.31
],
[363565509.9,
442287238.4,
599628139.2,
627073181.8,
506350475.4,
467160077.6,
439497656,
479871543.2,
319743816.9,
309874930.4,
366245725.8,
349028714.2
],
[102443678.4,
128435002.1,
151620471.3,
168353431.7,
124005338.6,
131027235.5,
116313496.3,
106157376.3,
77806437,
87702570.03,
94319970.21,
89135347.82
]
])
for i in range(5):
    Y=Y_all[i]
    # Y=abs(Y)
    # print(X[:,1],Y)
    # 模型搭建
    model = LinearRegression()
    model.fit(X,Y)

    # 模型可视化
    plt.scatter(X,Y)
    plt.plot(X,model.predict(X),color='red')
    plt.xlabel('投资者悲观情绪指标月均值')
    plt.ylabel(bank_name)
    plt.show()

    #查看系数,截距：线性回归方程构造
    print(bank_name,"的一元线性回归方程的系数是",model.coef_)
    print(bank_name,"的一元线性回归方程的截距是",model.intercept_)
    # 计算相关系数
    x = X[:,0]
    y =Y
    # print(x,y)
    correlation_matrix = np.corrcoef(x, y)
    correlation_coefficient = correlation_matrix[0, 1]
    print(bank_name,"的相关系数是",correlation_coefficient)
    #相关系数检验
    r=correlation_coefficient
    print(bank_name,"的相关系数检验是",r*np.sqrt(12-2)/np.sqrt(1-np.power(r,2)))
   
